openfoam/rotst-rans/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          6000;
        startFace       172100;
        matchTolerance  0.0001;
        neighbourPatch  inlet;
        transformType   rotational;
        rotationAxis    (0 0 1);
        rotationCentre  (-1.380854733322674e-14 1.360023205165824e-15 0);
        rotationAngle   11.24999999993825;
    }
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          6000;
        startFace       178100;
        matchTolerance  0.0001;
        neighbourPatch  outlet;
        transformType   rotational;
        rotationAxis    (0 0 1);
        rotationCentre  (-1.380854733322674e-14 1.360023205165824e-15 0);
        rotationAngle   -11.24999999993825;
    }
    stator
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1500;
        startFace       184100;
    }
    rotor
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1500;
        startFace       185600;
    }
    shroud
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       187100;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       187500;
    }
)

// ************************************************************************* //
